[
    {
        "id": 1,
        "scenario": "As a parent, your child tells you they are scared after hearing about gun violence on the news.",
        "goal": "Listen and respond."
    },
    {
        "id": 2,
        "scenario": "As a parent, your child asks why people hurt others with guns in general.",
        "goal": "Offer a simple explanation."
    },
    {
        "id": 3,
        "scenario": "As a parent, your child shares that they lost a family member or friend to gun violence.",
        "goal": "Be present and acknowledge feelings."
    },
    {
        "id": 4,
        "scenario": "As a parent, your child expresses fear after seeing a violent video involving guns online.",
        "goal": "Help them talk through what they saw."
    },
    {
        "id": 5,
        "scenario": "As a parent, your child tells you they are worried about themselves or others even though nothing happened at school.",
        "goal": "Listen and reassure."
    },

    {
        "id": 7,
        "scenario": "As a parent, your child wants to talk about how a community member was affected by gun violence.",
        "goal": "Encourage conversation."
    },
    {
        "id": 8,
        "scenario": "As a parent, your child shares that they feel nervous when hearing news about gun violence.",
        "goal": "Acknowledge their feelings."
    },
    {
        "id": 9,
        "scenario": "As a parent, your child asks why the news talks so much about shootings.",
        "goal": "Offer a short explanation."
    },
    {
        "id": 10,
        "scenario": "As a parent, your child wants to write a school assignment about gun safety and asks for guidance.",
        "goal": "Talk through ideas together."
    },
    {
        "id": 11,
        "scenario": "As a parent, your child talks about a friend who witnessed gun violence in the past.",
        "goal": "Listen and reflect back."
    },
    {
        "id": 12,
        "scenario": "As a parent, your child expresses fear after hearing about gun violence in a movie or TV show.",
        "goal": "Discuss what was real and what was pretend."
    },
    {
        "id": 13,
        "scenario": "As a parent, your child asks if it’s normal to feel anxious after hearing news of shootings.",
        "goal": "Acknowledge their feelings."
    },
    {
        "id": 14,
        "scenario": "As a parent, your child asks why some kids joke about guns.",
        "goal": "Offer a simple perspective."
    },
    {
        "id": 16,
        "scenario": "As a parent, your child asks how to support a friend who is grieving due to gun violence.",
        "goal": "Talk through possibilities."
    },
    {
        "id": 17,
        "scenario": "As a parent, your child expresses fear after hearing about a past incident that happened in another city.",
        "goal": "Acknowledge and respond."
    },
    {
        "id": 18,
        "scenario": "As a parent, your child asks why people sometimes feel unsafe around guns.",
        "goal": "Offer a neutral explanation."
    },
    {
        "id": 19,
        "scenario": "As a parent, your child shares feelings of sadness after learning that someone they know experienced gun violence.",
        "goal": "Listen and empathize."
    },
    {
        "id": 20,
        "scenario": "As a parent, your child wants to discuss gun safety as part of a school project.",
        "goal": "Talk about ideas together."
    },
    {
        "id": 21,
        "scenario": "As a parent, your child asks why guns can be dangerous even if no one is using them right now.",
        "goal": "Offer a short explanation."
    },
    {
        "id": 22,
        "scenario": "As a parent, your child expresses worry about what might happen in general, not at school.",
        "goal": "Acknowledge feelings and talk through them."
    },
    {
        "id": 23,
        "scenario": "As a parent, your child asks about how families cope after learning about gun safety or past incidents.",
        "goal": "Offer a neutral perspective."
    },
    {
        "id": 24,
        "scenario": "As a parent, your child asks why some people talk about guns even if nothing happened.",
        "goal": "Offer a simple explanation."
    },
    {
        "id": 25,
        "scenario": "As a parent, your child shares that hearing about past incidents makes them feel uneasy.",
        "goal": "Listen and acknowledge feelings."
    }
]