[
    {
        "id": 1,
        "scenario": "As a teacher, a student tells you they are scared after hearing about gun violence on the news.",
        "goal": "Offer a simple explanation and acknowledge their feelings."
    },
    {
        "id": 2,
        "scenario": "As a teacher, a student asks why people hurt others with guns in general.",
        "goal": "Give a calm, neutral answer."
    },
    {
        "id": 3,
        "scenario": "As a teacher, a student shares that they lost a family member or friend to gun violence.",
        "goal": "Provide a comforting response and let them speak."
    },
    {
        "id": 4,
        "scenario": "As a teacher, a student expresses fear after seeing a violent video involving guns online.",
        "goal": "Explain the difference between reality and fiction."
    },
    {
        "id": 5,
        "scenario": "As a teacher, a student tells you they are worried about themselves or others even though nothing happened at school.",
        "goal": "Reassure gently and normalize their feelings."
    },
    {
        "id": 6,
        "scenario": "As a teacher, a student asks why some people carry guns.",
        "goal": "Provide a neutral and simple explanation."
    },
    {
        "id": 7,
        "scenario": "As a teacher, a student wants to talk about how a community member was affected by gun violence.",
        "goal": "Listen and respond thoughtfully."
    },
    {
        "id": 8,
        "scenario": "As a teacher, a student shares that they feel nervous when hearing news about gun violence.",
        "goal": "Acknowledge their feelings and provide a calm response."
    },
    {
        "id": 9,
        "scenario": "As a teacher, a student asks why the news talks so much about shootings.",
        "goal": "Offer a simple explanation and context."
    },
    {
        "id": 10,
        "scenario": "As a teacher, a student wants to write a school assignment about gun safety and asks for guidance.",
        "goal": "Encourage their ideas and provide gentle guidance."
    },
    {
        "id": 11,
        "scenario": "As a teacher, a student talks about a friend who witnessed gun violence in the past.",
        "goal": "Respond with empathy and invite them to share more."
    },
    {
        "id": 12,
        "scenario": "As a teacher, a student expresses fear after hearing about gun violence in a movie or TV show.",
        "goal": "Clarify the difference between real events and fiction."
    },
    {
        "id": 13,
        "scenario": "As a teacher, a student asks if it’s normal to feel anxious after hearing news of shootings.",
        "goal": "Normalize their feelings and provide reassurance."
    },
    {
        "id": 14,
        "scenario": "As a teacher, a student asks why some students joke about guns.",
        "goal": "Offer a calm, simple explanation about behavior."
    },
    {
        "id": 15,
        "scenario": "As a teacher, a student shares they have questions about what happened to someone affected by gun violence.",
        "goal": "Give clear, age-appropriate answers."
    },
    {
        "id": 16,
        "scenario": "As a teacher, a student asks how to support a friend who is grieving due to gun violence.",
        "goal": "Suggest simple ways to show care."
    },
    {
        "id": 17,
        "scenario": "As a teacher, a student expresses fear after hearing about a past incident that happened in another city.",
        "goal": "Provide context and reassurance."
    },
    {
        "id": 18,
        "scenario": "As a teacher, a student asks why people sometimes feel unsafe around guns.",
        "goal": "Give a neutral explanation and context."
    },
    {
        "id": 19,
        "scenario": "As a teacher, a student shares feelings of sadness after learning that someone they know experienced gun violence.",
        "goal": "Respond empathetically and acknowledge their feelings."
    },
    {
        "id": 20,
        "scenario": "As a teacher, a student wants to discuss gun safety as part of a class project.",
        "goal": "Encourage thoughtful discussion and input."
    },
    {
        "id": 21,
        "scenario": "As a teacher, a student asks why guns can be dangerous even if no one is using them right now.",
        "goal": "Explain in a simple and clear way."
    },
    {
        "id": 22,
        "scenario": "As a teacher, a student expresses worry about what might happen in general, not at school.",
        "goal": "Offer reassurance and context."
    },
    {
        "id": 23,
        "scenario": "As a teacher, a student asks about how families cope after losing someone to gun violence.",
        "goal": "Provide an age-appropriate explanation."
    },
    {
        "id": 24,
        "scenario": "As a teacher, a student asks why some people talk about guns even if nothing happened.",
        "goal": "Offer a simple explanation about social behavior."
    },
    {
        "id": 25,
        "scenario": "As a teacher, a student shares that hearing about past shootings makes them feel unsafe in general.",
        "goal": "Acknowledge their feeling and give gentle reassurance."
    },
    {
        "id": 26,
        "scenario": "As a teacher, a student wants to write a story about gun violence and asks how to do it responsibly.",
        "goal": "Provide gentle guidance and encourage expression."
    },
    {
        "id": 27,
        "scenario": "As a teacher, a student asks why some people react strongly to news about guns.",
        "goal": "Explain calmly that people respond differently."
    },
    {
        "id": 28,
        "scenario": "As a teacher, a student asks how to talk to younger siblings about past gun violence safely.",
        "goal": "Offer simple suggestions for discussion."
    },
    {
        "id": 29,
        "scenario": "As a teacher, a student expresses anxiety after hearing about past incidents in the community.",
        "goal": "Acknowledge their feelings and provide calm context."
    },
    {
        "id": 30,
        "scenario": "As a teacher, a student asks why people carry guns even when they don’t need them.",
        "goal": "Give a neutral and clear answer."
    },
    {
        "id": 31,
        "scenario": "As a teacher, a student wants to discuss news stories about gun violence and asks how to handle them.",
        "goal": "Invite their perspective and respond calmly."
    },
    {
        "id": 32,
        "scenario": "As a teacher, a student expresses concern about friends who may be anxious about past gun violence.",
        "goal": "Offer empathetic suggestions subtly."
    },
    {
        "id": 33,
        "scenario": "As a teacher, a student asks what it means when someone talks about being afraid of guns.",
        "goal": "Give a simple explanation and reassurance."
    },
    {
        "id": 34,
        "scenario": "As a teacher, a student asks why some families talk about past incidents of gun violence.",
        "goal": "Provide a calm, clear explanation."
    },
    {
        "id": 35,
        "scenario": "As a teacher, a student wants to write a reflection on how gun violence affects communities.",
        "goal": "Encourage thoughtful expression."
    },
    {
        "id": 36,
        "scenario": "As a teacher, a student asks how to feel safe after hearing news about gun violence in general.",
        "goal": "Offer simple reassurance and context."
    },
    {
        "id": 37,
        "scenario": "As a teacher, a student shares they feel anxious after reading about a past incident.",
        "goal": "Acknowledge their feelings and respond calmly."
    },
    {
        "id": 38,
        "scenario": "As a teacher, a student asks why some people are affected by gun violence more than others.",
        "goal": "Provide a simple, age-appropriate explanation."
    },
    {
        "id": 39,
        "scenario": "As a teacher, a student expresses concern about friends who are scared after hearing about gun violence.",
        "goal": "Offer subtle guidance and reassurance."
    },
    {
        "id": 40,
        "scenario": "As a teacher, a student asks why some media shows gun violence even if nothing happened locally.",
        "goal": "Explain briefly and provide context."
    },
    {
        "id": 41,
        "scenario": "As a teacher, a student asks what to do if they feel scared about past incidents.",
        "goal": "Offer a calm, simple suggestion."
    },
    {
        "id": 42,
        "scenario": "As a teacher, a student expresses curiosity about why gun violence happens in general.",
        "goal": "Respond calmly and clearly."
    },
    {
        "id": 43,
        "scenario": "As a teacher, a student asks how to help friends who are anxious about gun violence.",
        "goal": "Give gentle guidance for support."
    },
    {
        "id": 44,
        "scenario": "As a teacher, a student expresses worry after hearing about a past shooting in another city.",
        "goal": "Offer calm context and reassurance."
    },
    {
        "id": 45,
        "scenario": "As a teacher, a student wants to talk about their feelings regarding past incidents.",
        "goal": "Invite them to share freely."
    },
    {
        "id": 46,
        "scenario": "As a teacher, a student asks why people sometimes feel unsafe around guns, even if nothing happened recently.",
        "goal": "Give a simple, calm answer."
    },
    {
        "id": 47,
        "scenario": "As a teacher, a student expresses sadness after hearing a story about someone affected by gun violence.",
        "goal": "Acknowledge and reflect back their feelings."
    },
    {
        "id": 48,
        "scenario": "As a teacher, a student asks why some people react strongly to news about gun violence.",
        "goal": "Explain simply that reactions vary."
    },
    {
        "id": 49,
        "scenario": "As a teacher, a student asks how to feel safe while discussing past incidents.",
        "goal": "Provide simple reassurance and context."
    }
]